tutorials/acoustics/gaussPulse_OF_OF/fluid_B/system/controlDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 location "system";
 object controlDict;
}

application fluidFoam;

startFrom latestTime;

startTime 0;

stopAt endTime;

endTime 500e-5;

deltaT 1e-5;

writeControl timeStep;

writeInterval 1;

purgeWrite 0;

writeFormat ascii;

writePrecision 20;

writeCompression uncompressed;

timeFormat general;

timePrecision 10;

runTimeModifiable yes;
adjustTimeStep no;
maxCo 0.8;
