tutorials/acoustics/gaussPulse_OF_OF/fluid_B/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



convertToMeters 1;

vertices
(
    (0 -2 -2)
    (2 -2 -2)
    (2 2 -2)
    (0 2 -2)

    (0 -2 2)
    (2 -2 2)
    (2 2 2)
    (0 2 2)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 40 40) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    patch bottom
    (
        (0 1 2 3)
    )
    patch top
    (
        (4 5 6 7)
    )
    patch west
    (
        (0 4 7 3)
    )
    patch east
    (
        (1 5 6 2)
    )
    patch north
    (
        (3 2 6 7)
    )
    patch south
    (
        (0 1 5 4)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
