tutorials/acoustics/gaussPulse_OF_OF/fluid_B/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   dynamicMotionSolverFvMesh;

//solver RBFMeshRigidMeshMotionSolver;
solver RBFMeshMotionSolver;

movingPatches (  );

staticPatches ( );

fixedPatches ( top bottom );

faceCellCenters false;

coarsening
{
  enabled true;
  tol 1.0e-4;
  minPoints 10;
  maxPoints 10;
  livePointSelection false;
  tolLivePointSelection 1.0e-3;
  exportSelectedPoints false;
}

interpolation
{
  function TPS;
}
