tutorials/acoustics/gaussPulse_OF_OF/fluid_B/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    Up
    {
        solver BiCGStab;
        preconditioner Cholesky;

        tolerance 1e-13;
        relTol 1.0e-3;

        maxIter 500;
        minIter 1;
    }

    "(p|pFinal)"
    {
      solver           PCG;
      preconditioner   DIC;
      tolerance        1e-13;
      relTol           1.0e-3;
      minIter          1;
    }

    "(U|UFinal)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-13;
        relTol          1.0e-3;
        minIter         1;
    }

    h
    {
      solver PBiCG;
      preconditioner DILU;
      tolerance 1e-13;
      relTol 1e-3;
    }
}

PIMPLE
{
  nOuterCorrectors 500;
  nCorrectors 1;
  nNonOrthogonalCorrectors 0;
}

blockSolver
{
    pRefCell 0;
    pRefValue 0;
    nOuterCorrectors 10;
    convergenceTolerance 1e-9;
}


// ************************************************************************* //
